INSERT INTO students (name, kana_name, nickname, email, area, age, gender)
VALUES ('山田太郎', 'ヤマダタロウ', 'たろちゃん', 'taro@example.com', '東京都', 25, '男性'),
       ('佐藤花子', 'サトウハナコ', 'はなちゃん', 'hanako@example.com', '大阪府', 22, '女性'),
       ('鈴木一郎', 'スズキイチロウ', 'イチロー', 'ichiro@example.com', '北海道', 30, '男性'),
       ('田中美咲', 'タナカミサキ', 'みーちゃん', 'misaki@example.com', '福岡県', 28, '女性'),
       ('高橋健太', 'タカハシケンタ', 'けんけん', 'kenta@example.com', '愛知県', 26, 'その他');

INSERT INTO students_courses (student_id, course_name, course_start_at, course_end_at)
VALUES (1, 'Javaコース', '2025-09-01 00:00:00', '2025-10-01 00:00:00'),
       (2, 'AWSコース', '2025-09-10 00:00:00', '2025-10-10 00:00:00'),
       (3, 'デザインコース', '2025-09-20 00:00:00', '2025-10-20 00:00:00'),
       (4, 'Javaコース', '2025-09-25 00:00:00', '2025-10-25 00:00:00'),
       (2, 'Javaコース', '2025-10-15 00:00:00', '2025-11-15 00:00:00'),
       (5, 'AWSコース', '2025-10-15 00:00:00', '2025-11-15 00:00:00');